[
  {
    "Timestamp":"4/19/2015 9:28:19",
    "Name":"Karl Eckhardt",
    "Year that you joined the OWRC":2010,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide longer-term mentoring (or co-mentoring)",
    "email":"eckhardtk@gmail.com",
    "Country":"USA",
    "Latitude":47.606209,
    "Longitude":-122.332071,
    "State":"WA",
    "degree":"University of Washington, Foster School of Business - MBA (Expected 2017)\nUniversity of Washington, Foster School of Business- B.A.B.A. with a concentration in Finance (2012)\nUniversity of Washington, Jackson School of International Studies - B.A. in International Studies with a concentration in International Political Economy (2012)",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"KarlEckhardt.png",
    "Occupation":"Product Designer",
    "link":"https://www.linkedin.com/in/karleckhardt",
    "about":"Hi, my name is Karl Eckhardt and I graduated from UW with undergraduate degrees in Business Administration and International studies, and am now returning to pursue an MBA. I have worked in a variety of positions in education, the non-profit sector, and have held positions at several for-profit companies including Xela Capital (a hedge fund) and Liberty Mutual Insurance. Currently I work for Liberty Mutual Insurance, where I work on product design and pricing for the state of TX. Knowing the people that come through the OWRC, I’d love to chat with any current tutors or alums – but would be most interested in talking to anyone looking to work/working in the financial services industry/major corporations or anyone in the field of education. ",
    "FIELD18":""
  },
  {
    "Timestamp":"4/19/2015 12:21:48",
    "Name":"Travis Grandy",
    "Year that you joined the OWRC":2006,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"travis.grandy@gmail.com",
    "Country":"USA",
    "Latitude":42.34038,
    "Longitude":-72.496819,
    "State":"MA",
    "degree":"University of Massachusetts Amherst – Ph.D. in English, Program in Composition and Rhetoric, In Progress\nUniversity of Massachusetts Amherst – M.A. in English, 2013\nUniversity of Washington Seattle – B.A. in English, concentration in Creative Writing; B.A. in Law, Societies & Justice, minor in Disability Studies; June 2008",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"http://www.travisgrandy.com/wp-content/uploads/2015/04/TravisGrandy1-300x200.png",
    "Occupation":"PhD Student",
    "link":"www.travisgrandy.com",
    "about":"I am is a doctoral student studying Composition and Rhetoric at the University of Massachusetts Amherst. My research areas include discourse & genre studies, queer & disability studies, writing in new media, and writing across the curriculum. I can't overstate how much of an impact working at OWRC has had on my academic and professional career! As graduate student, I am now assistant director at the writing center at my institution where I get to train and mentor undergraduate tutors. I'm happy to chat with anyone considering going on to graduate studies. ",
    "FIELD18":""
  },
  {
    "Timestamp":"4/19/2015 16:05:01",
    "Name":"Michelle Venetucci-Harvey",
    "Year that you joined the OWRC":2010,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"michelle.ann.harvey@gmail.com",
    "Country":"USA",
    "Latitude":37.774929,
    "Longitude":-122.419416,
    "State":"CA",
    "degree":"BA in (double major) Anthropology and Community, Environment and Planning (CEP) from the UW.\n\nCodepath's iOS For Designers Bootcamp in 2015 - San Francisco, Honor: top three",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Product Designer",
    "link":"https://twitter.com/mvenetucci",
    "about":"I'm Michelle, and I'm currently a Product Designer and Frontend Developer at thoughtbot in San Francisco.\n\nthoughtbot is a development and design consultancy that helps clients build early stage products. We mostly work on web apps and iOS apps. My role is to provide user-driven product thinking and design, as well as help implement the design in the final product. I also have a special interest in women in tech and am involved with various groups focused on creating more diversity in tech.\n\nI'm happy to talk to anyone about the tech industry and how to build your career in non-traditional ways.\n\n(thoughtbot is intentionally lowercase. It's constantly a problem and is grammatically incorrect, but the company wants it to be lowercase. That's as much as I know.)",
    "FIELD18":""
  },
  {
    "Timestamp":"4/19/2015 16:59:40",
    "Name":"Mark Forman",
    "Year that you joined the OWRC":2010,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"mark010585@hotmail.com",
    "Country":"USA",
    "Latitude":32.776664,
    "Longitude":-96.796988,
    "State":"TX",
    "degree":"M.I.T- University of Washington\nB.S.- Psychology- University of Washington\nB.A.- English- University of Washington",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Front-end Developer",
    "link":"https://www.linkedin.com/profile/public-profile-settings?trk=prof-0-ovw-public_profile-secondary",
    "about":"Hello, my name is Mark Forman.  I earned a Master in Teaching degree, joined Teach For America, and served for three years as a 7th- and 8th-grade ELA teacher at an all-boys school in Wilmington, DE.  I am currently serving in my first year as a Dean for a middle-school in Dallas, TX.  I would definitely be interested in connecting with anyone who has any questions about teaching or school leadership in a middle- and high-school setting.",
    "FIELD18":""
  },
  {
    "Timestamp":"4/19/2015 17:43:58",
    "Name":"Tish Lopez",
    "Year that you joined the OWRC":2006,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide job shadowing opportunities, Review job application materials",
    "email":"Leticia.Lopez@SeattleColleges.edu",
    "Country":"USA",
    "Latitude":47.606209,
    "Longitude":-122.332071,
    "State":"WA",
    "degree":"University of Washington\n-- PhD in Composition and Rhetoric (in progress)\n-- MA in English Language and Literature\n\nClaremont McKenna College\n-- BA in Literature and American Studies\n\nVentura Community College\n-- AA in Liberal Studies",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Dean for middle school",
    "link":"https://www.linkedin.com/pub/leticia-tish-lopez/0/a85/64a",
    "about":"Greetings!  My name is Tish and I was the OWRC Director from 2006-2008.  Currently I'm working as a tenured English faculty member at South Seattle College in Seattle, WA.  Before that, I taught at several post-secondary institutions, including Edmonds Community College, Bellevue College and the University of Washington.  In addition to teaching at the college and university level, I ran two writing centers at UW (CLUE and the OWRC) as well as served as the English Language Learning Specialist for UW’s Academic Support Programs. My research/professional/activist areas of interest are always changing, but I'm currently interested in examining the latest research regarding online teaching and learning as well as identifying ways to increase student success and retention at two-year academic institutions.\n\nIf any of you are interested in pursuing a tenure-track job at the community college-level, please feel free to contact me.  I've served on a number of tenure-track hiring committees and am happy to share my knowledge with you.\n\nI hope all of my former tutors are doing well. I'd love to hear from you!",
    "FIELD18":""
  },
  {
    "Timestamp":"4/19/2015 18:20:59",
    "Name":"Katie Corcoran",
    "Year that you joined the OWRC":2008,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide longer-term mentoring (or co-mentoring)",
    "email":"kat777@uw.edu",
    "Country":"USA",
    "Latitude":39.629526,
    "Longitude":-79.955897,
    "State":"WV",
    "degree":"University of Washington, Ph.D. in Sociology, Graduated Dec. 2012 (Major Area: Institutional Analysis and Social Movements; Minor Area: Sociology of Religion)\n\nUniversity of Washington, Minor Certification in Social Statistics, from the Center for Statistics and the Social Sciences (CSSS)\n\nUniversity of Washington, Masters of International Studies (Comparative Religion), Graduated 2009\n\nUniversity of Washington, Masters of Sociology, Graduated 2006\n\nUniversity of Washington, BA Sociology and Comparative Religion, Graduated 2004",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"English faculty member",
    "link":"http://www.kecorcoran.com/",
    "about":"My name is Katie Corcoran and I am an alum of both the Sociology department and Comparative Religion program (International Studies). After receiving my Ph.D. in Sociology, I worked as a post-doctoral fellow at Baylor University for two years and am currently a tenure-track Assistant Professor of Sociology at West Virginia University. I’ve published articles in numerous journals including the British Journal of Social Psychology, the Journal for the Scientific Study of Religion,  and Social Science Research,  and recently published the book Religious Hostility: A Global Assessment of Hatred and Terror with Rodney Stark. I also have over 4 years of teaching experience as a solo-instructor of record. I am happy to chat with current or past tutors regarding graduate studies, post-docs, academic careers, publishing, the academic job market, teaching, or anything that pertains to writing with the caveat that my experience is mostly in the social sciences.",
    "FIELD18":""
  },
  {
    "Timestamp":"4/20/2015 0:46:05",
    "Name":"Dillon G. Pruett",
    "Year that you joined the OWRC":2013,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide job shadowing opportunities",
    "email":"dillongpruett@gmail.com",
    "Country":"USA",
    "Latitude":36.162664,
    "Longitude":-86.781602,
    "State":"TN",
    "degree":"University of Washington\nB.S. Biology, Speech and Hearing Sciences",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Assistant Professor",
    "link":"",
    "about":"Hi, I'm Dillon Pruett and I graduated from UW in June 2014.  In addition to working for the OWRC, I also worked as a biology and psychology tutor for Student-Athlete Academic Services.  Prior to that, I worked as a student assistant at the UWMC otolaryngology clinic and served as a student research assistant in the Kaeberlein Pathology Lab.\n\nI will be starting my Ph.D. studies at Vanderbilt University in the fall of 2015.  I'm planning to pursue research related to the genetic components of communication disorders, especially stuttering.\n\nI would love to chat with any current tutors or alums. In particular, I’d be happy to chat with anyone who has questions about navigating the graduate school application process for the sciences or is curious about the intersection of the sciences and the ethos of the OWRC.",
    "FIELD18":""
  },
  {
    "Timestamp":"4/20/2015 2:22:10",
    "Name":"Helen Boyer",
    "Year that you joined the OWRC":2013,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide longer-term mentoring (or co-mentoring)",
    "email":"boyerh@uw.edu",
    "Country":"USA",
    "Latitude":47.530101,
    "Longitude":-122.032619,
    "State":"WA",
    "degree":"UW, MSW 2014, Health Concentration\nUW, JD 1986 (Articles Editor, Law Review)\nColumbia University Teachers College, MA, Education 1978 (qualifying for endorsements in Reading, Art, and English/Language Arts)\nStanford University, BA, Art 1974",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Student",
    "link":"https://www.linkedin.com/profile/view?id=53477032&trk=nav_responsive_tab_profile",
    "about":"I just decided what I want to do when I grow up--teach! I apparently knew this 35 or so years ago when I got an MA in Education, but law school and 23 years of law practice subsequently blotted everything else from my mind. I stumbled back to the UW for an MSW focused on end-of-life care and found the OWRC, where I remembered I love helping students, especially with their writing. Post-OWRC, I tutored writing online, did some editing, and presently teach in the Bellevue School District. I am one of four full-time substitutes who go into classrooms wherever the District has a need--often in hard-to-fill substitute positions such as special ed. Interests: equity in education, teaching writing, social justice, equal access to health care, palliative care, intergenerational connections and mentoring, non-violent communication. Glad to talk with anyone considering law, education, or social work careers.                 ",
    "FIELD18":""
  },
  {
    "Timestamp":"4/20/2015 5:27:47",
    "Name":"Pattamon Wattanawanitchakorn (Tae)",
    "Year that you joined the OWRC":2013,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"taetae21@gmail.com",
    "Country":"London",
    "Latitude":51.507351,
    "Longitude":-0.127758,
    "State":"",
    "degree":"Masters, LSE, Human Rights\nBA, University of Washington, Political Science and English",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Master Student",
    "link":"",
    "about":"My name is Tae and I am a recent UW Political Science and English alum.  I am currently doing my Masters in Human Rights.  Would be happy to chat with any current tutors or alums, particularly anyone with an interest in development NGO.",
    "FIELD18":""
  },
  {
    "Timestamp":"4/20/2015 7:44:07",
    "Name":"David Lawrence",
    "Year that you joined the OWRC":2012,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Take emails, Provide longer-term mentoring (or co-mentoring)",
    "email":"david.lawrence@nfwf.org",
    "Country":"USA",
    "Latitude":38.907192,
    "Longitude":-77.036871,
    "State":"WA",
    "degree":"PhD, Ecology, University of Washington, 2014\nMA, Ecology, Boston University, 2000",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Administration",
    "link":"http://davelawrence.weebly.com/outreach.html",
    "about":"Dave Lawrence is the Director of Freshwater Fish Conservation at the National Fish and Wildlife Foundation, a non-profit based in Washington, DC. In this role, Dave designs and manages initiatives aimed at restoring native trout, Pacific salmon, and fishes of the southeastern U.S. Dave completed his Ph.D. at the University of Washington in 2014.  In addition to conducting science Dave is also interested in the communication of science to the public.  Sure scientific manuscripts are important, but who reads them?  Other scientists.  Dave is dedicated to moving science from the library to more popular venues of scientific consumption, such as blogs, emedia, and magazines.",
    "FIELD18":""
  },
  {
    "Timestamp":"4/20/2015 8:46:29",
    "Name":"Jing-Lan",
    "Year that you joined the OWRC":2005,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide longer-term mentoring (or co-mentoring)",
    "email":"jinglanlee@gmail.com",
    "Country":"USA",
    "Latitude":37.338208,
    "Longitude":-121.886329,
    "State":"CA",
    "degree":"• University of Washington, B.A., magnum cum laude. Graduated 2008\n- International Studies, Concentration: Foreign Policy, Diplomacy, Peace, and Security (Departmental Honors)\n- Political Science\n\n• Cornell Law School, J.D. Graduated 2012\n- Concentration: Criminal Law / Procedure, Trial Advocacy\n- Moot Court Board/Editor, CLSA Mentor, APALSA Mentor",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Attorney",
    "link":"",
    "about":"My name is Jing-Lan Lee and I’m a proud UW Jackson School alum. I am currently practicing law as a Deputy District Attorney in the Bay Area, where I am originally from. I am more than happy to hear from any current tutors or alums. If you have any questions about what I do specifically, starting a career in law generally, or job opportunities overall, please feel free to contact me. ",
    "FIELD18":""
  },
  {
    "Timestamp":"4/20/2015 10:29:57",
    "Name":"Jacqueline Robinson-Hamm",
    "Year that you joined the OWRC":2013,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"jacnrh1@yahoo.com",
    "Country":"USA",
    "Latitude":35.994033,
    "Longitude":-78.898619,
    "State":"NC",
    "degree":"Duke University, PhD in Biomedical Engineering, Expected 2018\n\nUniversity of Washington, B.S. in Bioengineering, Graduated 2013",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"PhD Student",
    "link":"www.linkedin.com/in/jacnrh",
    "about":"Hi, I'm Jacqueline and I am currently a graduate student in the Department of Biomedical Engineering at Duke University pursuing my PhD. I am studying genome editing for muscular dystrophy. I am involved in student government organizations both in my department and that represents all of the Duke graduate and professional students. I am also working towards a Certificate in College Teaching through Duke. Although I have several years before I graduate, I am hoping to work in science policy after my PhD. I would love to chat with any current tutors or alums, especially in the area of genome science and policy! ",
    "FIELD18":""
  },
  {
    "Timestamp":"4/21/2015 19:21:55",
    "Name":"Jens Lloyd",
    "Year that you joined the OWRC":2007,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"bathbot@aol.com",
    "Country":"USA",
    "Latitude":36.778261,
    "Longitude":-119.417932,
    "State":"CA",
    "degree":"BA in English (with minor in Geography) at University of Washington; MA in English at University of California, Irvine",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"PhD Student",
    "link":"",
    "about":"I am currently a PhD candidate at UC Irvine in the English department. I study rhetoric/composition with a particular interest in the confluence of writing, rhetoric, and critical geography. That is, I am interested in how issues and problems related to geography intersect with issues and problems in rhet/comp.",
    "FIELD18":""
  },
  {
    "Timestamp":"4/25/2015 12:30:12",
    "Name":"Anastasia (Karin) Kharina ",
    "Year that you joined the OWRC":2011,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"anastasia.kharina@gmail.com",
    "Country":"USA",
    "Latitude":37.871593,
    "Longitude":-122.272747,
    "State":"CA",
    "degree":"University of Washington, Masters in Aerospace Engineering - Composite Materials for Airplane Structures, graduated 2012\nInstitut Teknologi Bandung-Indonesia, BA Materials Science and Engineering, graduated 2008",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Researcher",
    "link":"https://www.linkedin.com/in/akharin",
    "about":"Hi, my name is Karin and I'm a UW Masters in Aerospace Engineering Alum. I moved from rainy Seattle to foggy San Francisco after graduation in 2012 to start my job at the International Council on Clean Transportation, a non-profit environmental NGO focusing on transportation policy. I spend most of my time as a researcher working for our aviation program, but also started to do some work on Indonesian biofuels and air quality projects. I would be happy to chat with all alums/current tutors, especially those interested in engineering-and-public-policy-hybrid work, as well as aviation/fuel efficiency/emissions/air quality issues. ",
    "FIELD18":""
  },
  {
    "Timestamp":"4/26/2015 10:06:44",
    "Name":"Megan Bott",
    "Year that you joined the OWRC":2010,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"meganbott@gmail.com",
    "Country":"USA",
    "Latitude":47.606209,
    "Longitude":-122.332071,
    "State":"WA",
    "degree":"University of Washington, Master's in Social Worker with a concentration in Health, graduated 2011\n\nWilliams College, Bachelor's degree in English with a minor in Women's and Gender Studies, graduated 2000",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Administration",
    "link":"",
    "about":"Hi all, I'm Megan Bott, and I currently work on the hospital behavioral health team and in the emergency department at Virginia Mason Hospital.  My focus is working with patients with mental health and addiction issues, as well as creating care plans for those with care-interfering behaviors.  I have worked in many different direct service arenas, and would be happy to talk with those considering social work or with questions about program development. ",
    "FIELD18":""
  },
  {
    "Timestamp":"4/27/2015 20:11:31",
    "Name":"Jessica Jungwirth",
    "Year that you joined the OWRC":2009,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide longer-term mentoring (or co-mentoring), Provide job shadowing opportunities",
    "email":"jessicajungwirth@gmail.com",
    "Country":"USA",
    "Latitude":47.735928,
    "Longitude":-122.646537,
    "State":"WA",
    "degree":"Bachelor of Arts - 2011\nEnglish Literature (Major)\nCultural Anthropology - Globalization Studies emphasis (Major)",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Administration",
    "link":"https://www.linkedin.com/in/jessjungwirth",
    "about":"Jess Jungwirth here! I’m a 2011 alum from the Departments of English and Anthropology. Currently I work for Watson, a commercial furniture manufacturer located not far from Seattle. I joined Watson in 2011 following my graduation, initially providing communications support and project management to executive level management. Recently moved into our newly expanding Marketing department. I’d be happy to chat with anyone who is curious about private sector opportunities (and transitions) for humanities students and of course anything writing-related, especially blogging, creative nonfiction, memoir, and poetry. I also love to hear about my fellow OWRC alums' humanitarian, intellectual and otherwise world-changing efforts!",
    "FIELD18":""
  },
  {
    "Timestamp":"4/29/2015 21:11:40",
    "Name":"Katie Krupin",
    "Year that you joined the OWRC":2012,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide longer-term mentoring (or co-mentoring), Provide job shadowing opportunities",
    "email":"katiekrupin@gmail.com",
    "Country":"USA",
    "Latitude":47.606209,
    "Longitude":-122.332071,
    "State":"WA",
    "degree":"- B.S. in Biology, B.A. in Psychology from the University of Washington\n- As of Fall 2015: enrollment in the Education for Environment and Community graduate program at IslandWood on Bainbridge Island.",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Education director",
    "link":"https://www.linkedin.com/pub/kathryn-krupin/21/786/669",
    "about":"Currently, I am the Education Director at the Kirkland Boys & Girls Club.  However, come August, I will be moving to Bainbridge Island to begin working towards my Master's in Education for Environment and Community at IslandWood, in partnership with the UW College of Education.",
    "FIELD18":""
  },
  {
    "Timestamp":"5/13/2015 10:06:27",
    "Name":"Ariel Wetzel, PhD",
    "Year that you joined the OWRC":2011,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide longer-term mentoring (or co-mentoring), Provide job shadowing opportunities",
    "email":"arielw@uw.edu",
    "Country":"USA",
    "Latitude":47.606209,
    "Longitude":-122.332071,
    "State":"WA",
    "degree":"PhD in English literature at UW.  Dissertation on prisons in science fiction.\nMA in English literature at WWU.  Thesis on posthumanism at Walt Disney World.\nBA in Interdisciplinary Studies at Fairhaven College at WWU.  Concentration on creative writing, science fiction, and feminism.",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Lecturer",
    "link":"",
    "about":"After finishing my English Literature PhD at UW in 2014, I spent a year as an adjunct professor at Cornish College of the Arts, DigiPen Institute of Technology, and UW.  I taught courses on writing, science fiction, fandom studies, and television studies.  I have accepted a one-year lecturer position at UW Tacoma, where I will teach American Studies.\n\nI teach and research science fiction, popular culture, and working class culture.  I enjoy attending hybrid academic-fan conferences, especially WisCon, a feminist science fiction convention.  I am also a member of the Xena: Warrior Princess fandom, and travel annually to attend Xena fan conventions. ",
    "FIELD18":""
  },
  {
    "Timestamp":"5/14/2015 12:34:30",
    "Name":"Lois Haight",
    "Year that you joined the OWRC":2013,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"loisannhaight@gmail.com",
    "Country":"USA",
    "Latitude":47.606209,
    "Longitude":-122.332071,
    "State":"WA",
    "degree":"University of Washington, Masters in Library Information Science (MLIS), graduated June 2014\n\nUniversity of Washington, Bachelor of Arts in English, graduated June 2012 ",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Master Student",
    "link":"https://www.linkedin.com/in/loishaight",
    "about":"I am a recent UW Masters in Library Information Science graduate and I am currently studying at City University of Seattle. I am hoping to obtain my Masters in Teaching so that I can pursue a career in elementary school libraries. I am currently employed at Sno-Isle Libraries while I finish my education. I am interested in literacy, information science, and education. ",
    "FIELD18":""
  },
  {
    "Timestamp":"5/17/2015 23:16:56",
    "Name":"Lee Einhorn",
    "Year that you joined the OWRC":2009,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide longer-term mentoring (or co-mentoring), Provide job shadowing opportunities",
    "email":"leinhorn@ccsu.edu",
    "Country":"USA",
    "Latitude":41.66121,
    "Longitude":41.66121,
    "State":"CT",
    "degree":"BA, UCLA\nMA, Columbia University\nPhD*, UW",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Assistant Professor",
    "link":"http://web.ccsu.edu/english/faculty/einhorn.asp",
    "about":"I am a tenure-track, Assistant Professor of English at Central Connecticut State University. I also have the subtitle of \"Developmental Writing Specialist,\" a position created as a result of a CT state law that mandates a variety of regulations regarding developmental/remedial/basic writing/English. Specifically, I oversee our ENG 099 courses, our embedded remediation of standard FYC (akin to the ALP model), as well as the placement exam that our incoming students take to determine the best writing course for them (which I designed and manage). I also developed and co-direct the summer bridges program (http://www.ccsu.edu/bridges), which allows incoming students who place into 099-level courses to take that class during 7 weeks over the summer, and to also gain mentorship and transitional academic and life skills that will help them succeed in college. I also teach and work with other faculty on our English Dept gateway courses. Finally, I also consult for ESPN, specifically to help train and develop bilingual writers.",
    "FIELD18":""
  },
  {
    "Timestamp":"5/18/2015 7:14:34",
    "Name":"Matt Davidson",
    "Year that you joined the OWRC":2012,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"mattjd@uw.edu",
    "Country":"Vietnam",
    "Latitude":10.818463,
    "Longitude":106.658825,
    "State":"",
    "degree":"Preliminary Teaching License, English, Grades 8-12, Massachusetts\nUniversity of Washington, Master of Education (M.Ed.) in Learning Sciences (2014)\nUniversity of Texas, B.A. in History, English, and Philosophy (2007)",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"High school English teacher",
    "link":"",
    "about":"Hello, my name is Matt Davidson, and I recently earned my M.Ed. from UW's College of education, where I studied cognitive processes of writing and writing measurement and assessment. I have accepted a position as a high school English teacher for American International School Vietnam, which is located in Ho Chi Minh City (Saigon). Happy to speak with anyone who has questions/aspirations in education, international teaching, or writing assessment!",
    "FIELD18":""
  },
  {
    "Timestamp":"5/18/2015 14:37:23",
    "Name":"Jixia Ao",
    "Year that you joined the OWRC":2012,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person), Provide longer-term mentoring (or co-mentoring)",
    "email":"aojixia@uw.edu",
    "Country":"USA",
    "Latitude":47.606209,
    "Longitude":-122.332071,
    "State":"WA",
    "degree":"Bachelor of Arts with a double major in Anthropology and Comparative History of Ideas, University of Washington ",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"Master Student",
    "link":"",
    "about":"I am currently an Americorps VISTA at the Mockingbird Society, which as an advocacy organization with a mission to improve foster care and end youth homelessness. My main project for the year is making recommendations to improve the methodology of Count Us In, King County's annual point in time count of homeless and unstably housed youth and young adults. I also volunteer at the New Beginnings domestic violence emergency shelter. I'm interested in intimate violence prevention, sex and relationship education, qualititative social sciences, feminism, reproductive justice, and social justice in general. I'm currently planning on going to grad school in a couple of years, once I decide exactly what sort of degree I want. ",
    "FIELD18":""
  },
  {
    "Timestamp":"5/20/2015 17:01:27",
    "Name":"Christine Woodward",
    "Year that you joined the OWRC":2009,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails, Meet for informational interviews (Skype/in-person)",
    "email":"christinelenorew@gmail.com",
    "Country":"USA",
    "Latitude":38.040584,
    "Longitude":-84.503716,
    "State":"KY",
    "degree":"University of Kentucky, MA in Geography, anticipated graduation May 2016\n\nUniversity of Washington, BA in Geography and Latin American Studies, Graduated June 2012",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"PhD Student",
    "link":"",
    "about":"I'm currently a Master's student in Geography at the University of Kentucky, and I research space, gender, and value in Brazil. In the two years between my undergrad and grad school, I worked at a housing authority and a YWCA (with the SafeChoice program). If you're interested in any of that stuff, feel free to contact me, or (if you're ever in Kentucky, for whatever reason) ask to have some coffee.   ",
    "FIELD18":""
  },
  {
    "Timestamp":"5/25/2015 16:31:48",
    "Name":"Helen Olsen",
    "Year that you joined the OWRC":2012,
    "Willing to be contacted for spotlight profile?":"Yes",
    "willing_to":"Meet for coffee/social events, Take emails",
    "email":"helen.olsen@rutgers.edu",
    "Country":"USA",
    "Latitude":40.495938,
    "Longitude":-74.424318,
    "State":"NJ",
    "degree":"Colorado College: Coursework in Sociology\n\nUniversity of Washington: B.A. Geography (Development Track) & Public Health w/ Departmental Honors, Minor African Studies\n\nTaaluma Institute of East Africa: Beginning & Intermediate Swahili",
    "Other research/professional/activist areas of interest":"",
    "Your current professional title/s (and former, if desired)":"",
    "profile_pic":"",
    "Occupation":"",
    "link":"",
    "about":"I am a third year PhD student in Geography at Rutgers University studying cervical cancer prevention programs in East Africa.",
    "FIELD18":""
  }
]
